Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/30/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-2o76H47SrdyJLuTq

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.whoami.helm_release.whoami: Refreshing state... [id=whoami]
module.kubernetes.module.test-server.helm_release.test-server: Refreshing state... [id=test-server]
module.kubernetes.module.grafana.helm_release.grafana-agent: Refreshing state... [id=grafana-agent]
module.kubernetes.module.grafana.helm_release.grafana: Refreshing state... [id=grafana]
module.kubernetes.module.traefik.helm_release.traefik: Refreshing state... [id=traefik]
module.kubernetes.module.react-starter-vite.helm_release.react-starter-vite: Refreshing state... [id=react-starter-vite]
module.kubernetes.module.postgresql.helm_release.postgresql: Refreshing state... [id=postgresql]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-namespace: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.local-storage-class: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_2: Refreshing state...
module.kubernetes.module.postgresql.kubernetes_config_map.sql_scripts: Refreshing state... [id=postgresql/sql-scripts]
module.kubernetes.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_1: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_3: Refreshing state...
module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts: Refreshing state... [id=postgresql/run-sql-scripts]
module.kubernetes.module.grafana.helm_release.loki: Refreshing state... [id=loki]
module.kubernetes.module.grafana.helm_release.promtail: Refreshing state... [id=promtail]
module.kubernetes.module.grafana.kubernetes_manifest.grafana-faro-svc: Refreshing state...
module.kubernetes.module.grafana.kubernetes_manifest.grafana-faro-middleware: Refreshing state...
module.kubernetes.module.grafana.kubernetes_manifest.grafana-agent-ingress: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress-middleware: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress: Refreshing state...
module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "do_not_use_in_code" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-2o76H47SrdyJLuTq/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kubernetes.module.postgresql.kubernetes_config_map.sql_scripts will be updated in-place
  ~ resource "kubernetes_config_map" "sql_scripts" {
      ~ data        = {
          ~ "thirtyinches_schema.sql" = <<-EOT
                -- Users table
                CREATE TABLE IF NOT EXISTS Users (
                    user_id SERIAL PRIMARY KEY,
                    email VARCHAR(255) NOT NULL UNIQUE,
                    first_name VARCHAR(255) NOT NULL,
                    last_name VARCHAR(255) NOT NULL,
                    created_at TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP
                );
                
              - -- -- Plans table
              - -- CREATE TABLE IF NOT EXISTS Plans (
              - --     plan_id SERIAL PRIMARY KEY,
              - --     name VARCHAR(255) NOT NULL,
              - --     description TEXT NOT NULL,
              - --     price DECIMAL(10, 2) NOT NULL,
              - --     period_type ENUM('MONTHLY', 'YEARLY') NOT NULL,
              - --     trial_days INTEGER DEFAULT NULL
              - -- );
              + -- Plans table
              + CREATE TABLE IF NOT EXISTS Plans (
              +     plan_id SERIAL PRIMARY KEY,
              +     name VARCHAR(255) NOT NULL,
              +     description TEXT NOT NULL,
              +     price DECIMAL(10, 2) NOT NULL,
              +     period_type ENUM('MONTHLY', 'YEARLY') NOT NULL,
              +     trial_days INTEGER DEFAULT NULL
              + );
                
                -- -- Subscriptions table
                -- CREATE TABLE IF NOT EXISTS Subscriptions (
                --     subscription_id SERIAL PRIMARY KEY,
                --     user_id INTEGER NOT NULL,
                --     plan_id INTEGER NOT NULL,
                --     start_date TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP,
                --     end_date TIMESTAMP WITHOUT TIME ZONE DEFAULT NULL,
                --     status ENUM('active', 'cancelled', 'expired') NOT NULL DEFAULT 'active',
                --     payment_method VARCHAR(255) DEFAULT NULL,
                --     FOREIGN KEY (user_id) REFERENCES Users(user_id) ON DELETE CASCADE,
                --     FOREIGN KEY (plan_id) REFERENCES Plans(plan_id) ON DELETE RESTRICT
                -- );
                
                -- -- Transactions table
                -- CREATE TABLE IF NOT EXISTS Transactions (
                --     transaction_id SERIAL PRIMARY KEY,
                --     subscription_id INTEGER NOT NULL,
                --     amount DECIMAL(10, 2) NOT NULL,
                --     payment_date TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP,
                --     payment_method VARCHAR(255) DEFAULT NULL,
                --     status ENUM('successful', 'failed', 'pending') NOT NULL DEFAULT 'pending',
                --     FOREIGN KEY (subscription_id) REFERENCES Subscriptions(subscription_id) ON DELETE CASCADE
                -- );
                
                -- -- Add any additional tables or constraints as needed
                -- -- Example of adding an index on email for faster lookup
                -- CREATE INDEX idx_users_email ON Users(email);
            EOT
        }
        id          = "postgresql/sql-scripts"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts must be replaced
-/+ resource "kubernetes_job" "run_sql_scripts" {
      ~ id                  = "postgresql/run-sql-scripts" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {} -> (known after apply)
            name             = "run-sql-scripts"
          ~ resource_version = "17762802" -> (known after apply)
          ~ uid              = "95bbddbc-3faa-4bb1-be4b-433508e1d2f2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - active_deadline_seconds = 0 -> null
          ~ completion_mode         = "NonIndexed" -> (known after apply)
          - manual_selector         = false -> null
            # (3 unchanged attributes hidden)

          - selector {
              - match_labels = {
                  - "batch.kubernetes.io/controller-uid" = "95bbddbc-3faa-4bb1-be4b-433508e1d2f2"
                } -> null
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  - labels           = {} -> null
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "postgres-client"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (6 unchanged attributes hidden)

                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (3 unchanged blocks hidden)
                    }

                  ~ volume {
                        name = "sql-scripts-volume"

                      ~ config_map {
                            name         = "sql-scripts"
                          - optional     = false -> null
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>